//-----------------------------------------------------------
// Game.cpp
// ゲーム中心部
// 制作日 2015.03.01
// 制作者 motumotu
//-----------------------------------------------------------
#include "Game.h"

//-----------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------
Game::Game()
{
    game_data = new GameData();
    game_state = new GameState(game_data);
    game_manager = new GameManager(game_data, game_state);
    init();
}

//-----------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------
Game::~Game()
{
    delete(game_manager);
    delete(game_state);
    delete(game_data);
}

//-----------------------------------------------------------
// 初期化
//-----------------------------------------------------------
void Game::init()
{
    srand((unsigned)time(NULL));
}

//-----------------------------------------------------------
// 更新
//-----------------------------------------------------------
int Game::update()
{
    game_manager->getFPSManager()->update(); // FPS計測
    game_state->update();                    // 状態更新
    if (game_state->isGameEnd()) return -1;  // ゲーム終了
    game_manager->update();                  // 更新
    game_manager->getDrawManager()->draw();  // 描画
    game_manager->getFPSManager()->wait();   // FPS待機
    return 0;
}

//-----------------------------------------------------------
// メインループ
//-----------------------------------------------------------
int Game::mainLoop()
{
    while (1) {
        if (ProcessMessage() != 0) return -1; // システム処理
        if (ClearDrawScreen() != 0) return -1;       // 画面消去
        if (update() != 0) return -1;
    }
    return 0;
}

//===========================================================
// getter
//===========================================================

