//-----------------------------------------------------------
// MapData.cpp
// マップデータ
// 制作日 2015.03.01
// 制作者 motumotu
//-----------------------------------------------------------
#include "MapData.h"

//-----------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------
MapData::MapData()
{
    init();
}

//-----------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------
MapData::~MapData()
{

}

//-----------------------------------------------------------
// 初期化
//-----------------------------------------------------------
void MapData::init()
{
    map_size_width = 0;                        // マップの幅
    map_size_height = 0;                       // マップの高さ
    for (int i = 0; i < MAP_SIZE_MAX; i++)     // マップデータ
        for (int j = 0; j < MAP_SIZE_MAX; j++)
            map_data[i][j] = 0;
    player_base_x = 0;                         // 自拠点座標x
    player_base_y = 0;                         // 自拠点座標y
    enemy_base_x = 0;                          // 敵拠点座標x
    enemy_base_y = 0;
}

//-----------------------------------------------------------
// 範囲内チェック
//-----------------------------------------------------------
bool MapData::outCheck(int x, int y)
{
    if (x < 0 || x >= map_size_width || y < 0 || y >= map_size_height) {
        return true;
    }
    return false;
}

//-----------------------------------------------------------
// 床かどうか判定
// 床：true、それ以外：false
//-----------------------------------------------------------
bool MapData::isFloor(int x, int y)
{
    if (outCheck(x, y)) return false;
    if (map_data[y][x] != MAP_FLOOR) return false;
    return true;
}