//-----------------------------------------------------------
// SkillData.cpp
// スキル情報
// 制作日 2015.03.14
// 制作者 motumotu
//-----------------------------------------------------------
#include "SkillData.h"

//-----------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------
SkillData::SkillData()
{
    text[1] = "周囲１マス内の「スライム」と名の付くユニットの数ｘ１０だけ攻撃力が上昇する";
    text[2] = "このユニットの死亡時、スライムを２体生み出す";
}

//-----------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------
SkillData::~SkillData()
{

}

//-----------------------------------------------------------
// 取得
//-----------------------------------------------------------
std::string SkillData::getSkillText1(int n)
{
    if (text[n].length() >= LINE_TEXT_NUM * 2) {
        return text[n].substr(0, LINE_TEXT_NUM * 2);
    }
    else {
        return text[n].substr(0, text[n].length());
    }
}
std::string SkillData::getSkillText2(int n)
{
    if (text[n].length() < LINE_TEXT_NUM * 2) {
        return "";
    }
    else {
        return text[n].substr(LINE_TEXT_NUM * 2, text[n].length());
    }
}